In [1]:
import pandas as pd

In [2]:
hou=pd.read_excel("C:/Users/anvit/OneDrive/Desktop/house.xlsx")

In [3]:
hou

   S.no        room doors window chairs  sofa lights  fans    tv
0     1     dinning   two    two   four   two    one   one  none
1     2        hall   two   none    two   two    two   two   one
2     3     kitchen   one    one   none  none    one  none  none
3     4    bed room   one    one    one   one    two   one   one
4     5     balcony   one   none    two  none    one  none  none
5     6  guest room   one    one    one  none    two   one  none

Replace function allows you the flexibility to replace the column values with regular expressions for regex substitutions.

here it repalces one-1,two-2,four-4 and none as None

In [4]:
rp={'doors':{'one':1,'two':2},
    'window':{'one':1,'two':2,'none':None},
    'chairs':{'one':1,'two':2,'four':4,'none':None},
    'sofa':{'one':1,'two':2,'none':None},
    'lights':{'one':1,'two':2},
    'fans':{'one':1,'two':2,'none':None},
    'tv':{'one':1,'two':2,'none':None}}

In [5]:
house=hou.replace(rp)

In [6]:
house

   S.no        room  doors  window  chairs  sofa  lights  fans   tv
0     1     dinning      2     2.0     4.0   2.0       1   1.0  NaN
1     2        hall      2     NaN     2.0   2.0       2   2.0  1.0
2     3     kitchen      1     1.0     NaN   NaN       1   NaN  NaN
3     4    bed room      1     1.0     1.0   1.0       2   1.0  1.0
4     5     balcony      1     NaN     2.0   NaN       1   NaN  NaN
5     6  guest room      1     1.0     1.0   NaN       2   1.0  NaN

 encode() method is the method which allows us to convert a string into a specific format

In [7]:
encode={'doors':{'one':1,'two':2},
    'window':{'one':1,'two':2,'none':None},
    'chairs':{'one':1,'two':2,'four':4,'none':None},
    'sofa':{'one':1,'two':2,'none':None},
    'lights':{'one':1,'two':2},
    'fans':{'one':1,'two':2,'none':None},
    'tv':{'one':1,'two':2,'none':None}}

In [8]:
encode

{'doors': {'one': 1, 'two': 2},
 'window': {'one': 1, 'two': 2, 'none': None},
 'chairs': {'one': 1, 'two': 2, 'four': 4, 'none': None},
 'sofa': {'one': 1, 'two': 2, 'none': None},
 'lights': {'one': 1, 'two': 2},
 'fans': {'one': 1, 'two': 2, 'none': None},
 'tv': {'one': 1, 'two': 2, 'none': None}}

The info() method prints information about the DataFrame

In [9]:
house.info

<bound method DataFrame.info of    S.no        room  doors  window  chairs  sofa  lights  fans   tv
0     1     dinning      2     2.0     4.0   2.0       1   1.0  NaN
1     2        hall      2     NaN     2.0   2.0       2   2.0  1.0
2     3     kitchen      1     1.0     NaN   NaN       1   NaN  NaN
3     4    bed room      1     1.0     1.0   1.0       2   1.0  1.0
4     5     balcony      1     NaN     2.0   NaN       1   NaN  NaN
5     6  guest room      1     1.0     1.0   NaN       2   1.0  NaN>

shape method tells us number of rows and columns present in the data frame

In [10]:
house.shape

(6, 9)

size tells us the total number of elements present in the DataFrame

In [11]:
house.size

54

type function returnd the type of the dataframe

In [40]:
type(house)

pandas.core.frame.DataFrame

In [41]:
type(house['room'])

pandas.core.series.Series

In [42]:
type(house['tv'])

pandas.core.series.Series

The head() method returns a specified number of rows, string from the top.It returns the first 5 rows if a number is not specified.

In [43]:
house.head(4)

   S.no      room  doors  window  chairs  sofa  lights  fans   tv
0     1   dinning      2     2.0     4.0   2.0       1   1.0  NaN
1     2      hall      2     NaN     2.0   2.0       2   2.0  1.0
2     3   kitchen      1     1.0     NaN   NaN       1   NaN  NaN
3     4  bed room      1     1.0     1.0   1.0       2   1.0  1.0

The tail() method returns a specified number of rows, string from the bottom.It returns the last 5 rows if a number is not specified.

In [12]:
house.tail(4)

   S.no        room  doors  window  chairs  sofa  lights  fans   tv
2     3     kitchen      1     1.0     NaN   NaN       1   NaN  NaN
3     4    bed room      1     1.0     1.0   1.0       2   1.0  1.0
4     5     balcony      1     NaN     2.0   NaN       1   NaN  NaN
5     6  guest room      1     1.0     1.0   NaN       2   1.0  NaN

value_counts returns the count of each category

In [13]:
house['doors'].value_counts()

1    4
2    2
Name: doors, dtype: int64

In [14]:
house['chairs'].value_counts()

2.0    2
1.0    2
4.0    1
Name: chairs, dtype: int64

The .columns property returns the label of each column in the DataFrame.

In [45]:
house.columns

Index(['S.no', 'room', 'doors', 'window', 'chairs', 'sofa', 'lights', 'fans',
       'tv'],
      dtype='object')

The isnull() method returns a DataFrame object where all the values are replaced with a Boolean value True for NULL values, and otherwise False.

In [46]:
house.isnull()

    S.no   room  doors  window  chairs   sofa  lights   fans     tv
0  False  False  False   False   False  False   False  False   True
1  False  False  False    True   False  False   False  False  False
2  False  False  False   False    True   True   False   True   True
3  False  False  False   False   False  False   False  False  False
4  False  False  False    True   False   True   False   True   True
5  False  False  False   False   False   True   False  False   True

In [47]:
house['fans']

0    1.0
1    2.0
2    NaN
3    1.0
4    NaN
5    1.0
Name: fans, dtype: float64

.loc property allows the return of specified rows and/or columns from that DataFrame

In [52]:
house.loc[2]

S.no            3
room      kitchen
doors           1
window        1.0
chairs        NaN
sofa          NaN
lights          1
fans          NaN
tv            NaN
Name: 2, dtype: object

Using the iloc method in python, we can easily retrieve any particular value from a row or column by using index values.

In [50]:
house.iloc[3]

S.no             4
room      bed room
doors            1
window         1.0
chairs         1.0
sofa           1.0
lights           2
fans           1.0
tv             1.0
Name: 3, dtype: object

In [61]:
house

   S.no        room  doors  window  chairs  sofa  lights  fans   tv  door
0     1     dinning      2     2.0     4.0   2.0       1   1.0  NaN     1
1     2        hall      2     NaN     2.0   2.0       2   2.0  1.0     1
2     3     kitchen      1     1.0     NaN   NaN       1   NaN  NaN     1
3     4    bed room      1     1.0     1.0   1.0       2   1.0  1.0     1
4     5     balcony      1     NaN     2.0   NaN       1   NaN  NaN     1
5     6  guest room      1     1.0     1.0   NaN       2   1.0  NaN     1

The drop() method removes the specified row or column.it removes rows by default,it removes column when we give axis=1.

In [71]:
house.drop('door',axis=1,inplace=True)

In [72]:
house

   S.no        room  doors  window  chairs  sofa  lights  fans   tv
0     1     dinning      2     2.0     4.0     2       1   1.0  NaN
1     2        hall      2     NaN     2.0     2       2   2.0  1.0
2     3     kitchen      1     1.0     NaN     2       1   NaN  NaN
3     4    bed room      1     1.0     1.0     2       2   1.0  1.0
4     5     balcony      1     NaN     2.0     2       1   NaN  NaN
5     6  guest room      1     1.0     1.0     2       2   1.0  NaN

In [73]:
house.drop(3)

   S.no        room  doors  window  chairs  sofa  lights  fans   tv
0     1     dinning      2     2.0     4.0     2       1   1.0  NaN
1     2        hall      2     NaN     2.0     2       2   2.0  1.0
2     3     kitchen      1     1.0     NaN     2       1   NaN  NaN
4     5     balcony      1     NaN     2.0     2       1   NaN  NaN
5     6  guest room      1     1.0     1.0     2       2   1.0  NaN

The dropna() method removes the rows that contains NULL values.if we give inplace=True it deletes the row permanently from the DataFrame and gives new dataframe.

In [74]:
house.dropna()

   S.no      room  doors  window  chairs  sofa  lights  fans   tv
3     4  bed room      1     1.0     1.0     2       2   1.0  1.0

thresh:Any row/column with the number of non-NA values < thresh value is removed irrespective of other parameters passed.

In [75]:
house.dropna(thresh=2)

   S.no        room  doors  window  chairs  sofa  lights  fans   tv
0     1     dinning      2     2.0     4.0     2       1   1.0  NaN
1     2        hall      2     NaN     2.0     2       2   2.0  1.0
2     3     kitchen      1     1.0     NaN     2       1   NaN  NaN
3     4    bed room      1     1.0     1.0     2       2   1.0  1.0
4     5     balcony      1     NaN     2.0     2       1   NaN  NaN
5     6  guest room      1     1.0     1.0     2       2   1.0  NaN

.mean() function is used to calculate the mean of input values or data set.

In [79]:
x=house['window'].mean()

In [80]:
x

1.25

.mode function gives the freqency of the data set(the value which occured most).

In [81]:
y=house['chairs'].mode()

In [82]:
y

0    1.0
1    2.0
Name: chairs, dtype: float64

.median() method calculates the median (middle value) of the given data set

In [83]:
z=house['fans'].median()

In [84]:
z

1.0

The fillna() method replaces the NULL values with a specified value.

In [85]:
house.fillna(value=z)

   S.no        room  doors  window  chairs  sofa  lights  fans   tv
0     1     dinning      2     2.0     4.0     2       1   1.0  1.0
1     2        hall      2     1.0     2.0     2       2   2.0  1.0
2     3     kitchen      1     1.0     1.0     2       1   1.0  1.0
3     4    bed room      1     1.0     1.0     2       2   1.0  1.0
4     5     balcony      1     1.0     2.0     2       1   1.0  1.0
5     6  guest room      1     1.0     1.0     2       2   1.0  1.0

The nunique() method returns the number of unique values for each column.

In [86]:
house.nunique()

S.no      6
room      6
doors     2
window    2
chairs    3
sofa      1
lights    2
fans      2
tv        1
dtype: int64

displaying original dataframe

In [96]:
house

   S.no        room  doors  window  chairs  lights  fans   tv
0     1     dinning      2     2.0     4.0       1   1.0  NaN
1     2        hall      2     NaN     2.0       2   2.0  1.0
2     3     kitchen      1     1.0     NaN       1   NaN  NaN
3     4    bed room      1     1.0     1.0       2   1.0  1.0
4     5     balcony      1     NaN     2.0       1   NaN  NaN
5     6  guest room      1     1.0     1.0       2   1.0  NaN

.astype('category') is turning values into categorical data

In [110]:
house['room']=house['room'].astype('category')

.dtypes gives us information about: Type of the data,size of the data

In [111]:
house.dtypes

S.no         int64
room      category
doors        int64
window     float64
chairs     float64
lights       int64
fans       float64
tv         float64
new           int8
dtype: object

In [123]:
house

   S.no        room  doors  window  chairs  sofa  lights  fans   tv
0     1     dinning      2     2.0     4.0   2.0       1   1.0  NaN
1     2        hall      2     NaN     2.0   2.0       2   2.0  1.0
2     3     kitchen      1     1.0     NaN   NaN       1   NaN  NaN
3     4    bed room      1     1.0     1.0   1.0       2   1.0  1.0
4     5     balcony      1     NaN     2.0   NaN       1   NaN  NaN
5     6  guest room      1     1.0     1.0   NaN       2   1.0  NaN

get_dummies() is used for data manipulation.It converts categorical data into dummy,it gives dummy data

In [124]:
pd.get_dummies(house, columns=["doors"]).head()

   S.no      room  window  chairs  sofa  lights  fans   tv  doors_1  doors_2
0     1   dinning     2.0     4.0   2.0       1   1.0  NaN        0        1
1     2      hall     NaN     2.0   2.0       2   2.0  1.0        0        1
2     3   kitchen     1.0     NaN   NaN       1   NaN  NaN        1        0
3     4  bed room     1.0     1.0   1.0       2   1.0  1.0        1        0
4     5   balcony     NaN     2.0   NaN       1   NaN  NaN        1        0

ordinal encoding converts each label into integer values and the encoded data represents the sequence of labels.

In [16]:
from sklearn.preprocessing import OrdinalEncoder

In [17]:
obj=OrdinalEncoder()

In [18]:
house['encode']=obj.fit_transform(house[['doors']])

In [19]:
house.head()

   S.no      room  doors  window  chairs  sofa  lights  fans   tv  encode
0     1   dinning      2     2.0     4.0   2.0       1   1.0  NaN     1.0
1     2      hall      2     NaN     2.0   2.0       2   2.0  1.0     1.0
2     3   kitchen      1     1.0     NaN   NaN       1   NaN  NaN     0.0
3     4  bed room      1     1.0     1.0   1.0       2   1.0  1.0     0.0
4     5   balcony      1     NaN     2.0   NaN       1   NaN  NaN     0.0

encode() method is the method which allows us to convert a string into a specific format

In [20]:
encoded_1=house.replace(encode)

In [21]:
output=encoded_1.to_excel('data.xlsx')

In [22]:
pd.read_excel('data.xlsx')

,Unnamed: 0,S.no,room,doors,window,chairs,sofa,lights,fans,tv,encode
0,0,1,dinning,2,2.0,4.0,2.0,1,1.0,NaN,1
1,1,2,hall,2,NaN,2.0,2.0,2,2.0,1.0,1
2,2,3,kitchen,1,1.0,NaN,NaN,1,NaN,NaN,0
3,3,4,bed room,1,1.0,1.0,1.0,2,1.0,1.0,0
4,4,5,balcony,1,NaN,2.0,NaN,1,NaN,NaN,0
5,5,6,guest room,1,1.0,1.0,NaN,2,1.0,NaN,0